        BUI.use(['bui/grid','bui/data'],function(Grid,Data){
            var Grid = Grid,
          Store = Data.Store,
          columns = [{
              title : '付款时间',
              dataIndex :'a',
              width:150
            },{
              title : '支付方式',
              dataIndex :'b',
              width:100
            },{
              title : '店铺',
              dataIndex : 'c',
              width:150
          },{
              title : '金额',
              dataIndex : 'd',
              width:120
          },{
              title : '单据类型',
              dataIndex : 'e',
              width:100
          },{
              title : '订单号',
              dataIndex : 'f',
              width:180
          },{
              title : '支付/退款单号',
              dataIndex : 'g',
              width:180
          },
		  ],
          data = [
		  {a:'2016-03-01 10:08:06',b:'线下支付',c:'阿布才',d:'￥3,477.00',e:'付款单',f:'201603010910001210',g:'201603011012007080',},
          {a:'2016-03-01 10:52:05',b:'支付宝',c:'小妈悠悠',d:'￥3,5414.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 09:52:05',b:'线上支付',c:'益达之家',d:'￥2,5414.00',e:'付款单',f:'201603010910005874',g:'201603011012012578',},
          {a:'2016-03-01 08:52:05',b:'支付宝',c:'李二代购',d:'￥5,214.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 08:20:05',b:'线下支付',c:'小妈悠悠',d:'￥3,5414.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 10:08:06',b:'线下支付',c:'阿布才',d:'￥3,477.00',e:'付款单',f:'201603010910001210',g:'201603011012007080',},
          {a:'2016-03-01 10:52:05',b:'支付宝',c:'小妈悠悠',d:'￥3,5414.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 09:52:05',b:'线上支付',c:'益达之家',d:'￥2,5414.00',e:'付款单',f:'201603010910005874',g:'201603011012012578',},
          {a:'2016-03-01 08:52:05',b:'支付宝',c:'李二代购',d:'￥5,214.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 08:20:05',b:'线下支付',c:'小妈悠悠',d:'￥3,5414.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
		  {a:'2016-03-01 10:08:06',b:'线下支付',c:'阿布才',d:'￥3,477.00',e:'付款单',f:'201603010910001210',g:'201603011012007080',},
          {a:'2016-03-01 10:52:05',b:'支付宝',c:'小妈悠悠',d:'￥3,5414.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 09:52:05',b:'线上支付',c:'益达之家',d:'￥2,5414.00',e:'付款单',f:'201603010910005874',g:'201603011012012578',},
          {a:'2016-03-01 08:52:05',b:'支付宝',c:'李二代购',d:'￥5,214.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
          {a:'2016-03-01 08:20:05',b:'线下支付',c:'小妈悠悠',d:'￥3,5414.00',e:'付款单',f:'201603010910001210',g:'201603011012012578',},
		  ];
 
          // 实例化 Grid.Plugins.Cascade 插件
        var cascade = new Grid.Plugins.Cascade({
  		    renderer : function(record){
  			    return '<div style="padding: 10px 20px;"><h2>订单详情</h2><p>' + record.detail + '</p></div>';
  		    }
        });
        var store = new Store({
            data : data,
            autoLoad:true,
			remoteSort : true,
			pageSize:10		
          }),
          grid = new Grid.Grid({
            render:'#grid',
            columns : columns,
            idField : 'a',
            store: store,
	          plugins: [cascade],
			  bbar:{
                // pagingBar:表明包含分页栏
				/*pagingBar: {
					xclass: 'pagingBar'					
				}*/
                pagingBar:true
            },	
			  	// Grid.Plugins.Cascade 插件
          });
 
        grid.render();
		grid.on('cellclick',function  (ev) {
          var record = ev.record, //点击行的记录
            field = ev.field, //点击对应列的dataIndex
            target = $(ev.domTarget); //点击的元素
			<!--分页-->
			 
        });
      });