        BUI.use(['bui/grid','bui/data'],function(Grid,Data){
            var Grid = Grid,
          Store = Data.Store,
          columns = [{
              title : '订单号',
              dataIndex :'a',
              width:150
            },{
              title : '仓库名称',
              dataIndex :'b',
              width:120
            },{
              title : '商品名称',
              dataIndex : 'c',
              width:350
          },{
              title : '货号',
              dataIndex : 'd',
              width:120
          },{
              title : '品牌',
              dataIndex : 'e',
              width:100
          },{
              title : '商品类型',
              dataIndex : 'f',
              width:150
          },{
              title : '商品规格',
              dataIndex : 'g',
              width:120
          },{
              title : '数量',
              dataIndex : 'h',
              width:200
          },{
              title : '商品编号',
              dataIndex : 'i',
              width:150
          },{
              title : '销售金额',
              dataIndex : 'j',
              width:150
          },{
              title : '销售单时间',
              dataIndex : 'l',
              width:150
          },{
              title : '店铺名称',
              dataIndex : 'm',
              width:100
          },
		  ],
          data = [
		  {a:'201604071510001280',b:'大连仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'阿布才店',},
         {a:'201603020910003011',b:'上海仓库',c:'小林制药 女性生理期内衣裤专用除菌洗涤剂洗衣液120ml',d:'XH066447',e:'小林制药',f:'洗衣护理',g:'',h:'1',i:'XH066447',j:'￥22.00',l:'2016-03-02 14:32:47',m:'青木寨',},
          {a:'201603020910003011',b:'天津仓库',c:'UYEKI　除防螨杀菌喷雾　補充装230ml',d:'25878745',e:'威奇',f:'防虫驱蚊',g:'',h:'1',i:'FC061361',j:'￥70.00',l:'2016-04-09 13:09:57',m:'阿布才店',},
          {a:'201604071510001280',b:'大连仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'小妈悠悠',},
          {a:'201604071510001280',b:'日本仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'益达之家',},
          {a:'201604071510001280',b:'大连仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'阿布才店',},
         {a:'201603020910003011',b:'上海仓库',c:'小林制药 女性生理期内衣裤专用除菌洗涤剂洗衣液120ml',d:'XH066447',e:'小林制药',f:'洗衣护理',g:'',h:'1',i:'XH066447',j:'￥22.00',l:'2016-03-02 14:32:47',m:'青木寨',},
          {a:'201603020910003011',b:'天津仓库',c:'UYEKI　除防螨杀菌喷雾　補充装230ml',d:'25878745',e:'威奇',f:'防虫驱蚊',g:'',h:'1',i:'FC061361',j:'￥70.00',l:'2016-04-09 13:09:57',m:'阿布才店',},
          {a:'201604071510001280',b:'大连仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'小妈悠悠',},
          {a:'201604071510001280',b:'日本仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'益达之家',},
		  {a:'201604071510001280',b:'大连仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'阿布才店',},
         {a:'201603020910003011',b:'上海仓库',c:'小林制药 女性生理期内衣裤专用除菌洗涤剂洗衣液120ml',d:'XH066447',e:'小林制药',f:'洗衣护理',g:'',h:'1',i:'XH066447',j:'￥22.00',l:'2016-03-02 14:32:47',m:'青木寨',},
          {a:'201603020910003011',b:'天津仓库',c:'UYEKI　除防螨杀菌喷雾　補充装230ml',d:'25878745',e:'威奇',f:'防虫驱蚊',g:'',h:'1',i:'FC061361',j:'￥70.00',l:'2016-04-09 13:09:57',m:'阿布才店',},
          {a:'201604071510001280',b:'大连仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'小妈悠悠',},
          {a:'201604071510001280',b:'日本仓库',c:'花王 碧柔消毒泡沫弱酸性洗手液 补充装 无香型450ml',d:'XM762832',e:'花王 Kao',f:'洗发沐浴',g:'',h:'72',i:'XM762832',j:'￥1800.00',l:'2016-04-09 13:09:57',m:'益达之家',},
		  
		  ];
 
          // 实例化 Grid.Plugins.Cascade 插件
        var cascade = new Grid.Plugins.Cascade({
  		    renderer : function(record){
  			    return '<div style="padding: 10px 20px;"><h2>订单详情</h2><p>' + record.detail + '</p></div>';
  		    }
        });
        var store = new Store({
            data : data,
            autoLoad:true,
			remoteSort : true,
			pageSize:10	,
				
          }),
          grid = new Grid.Grid({
            render:'#grid',
            columns : columns,
            idField : 'a',
            store: store,
			width:1900,
	          plugins: [cascade],
			  bbar:{
                // pagingBar:表明包含分页栏
				/*pagingBar: {
					xclass: 'pagingBar'					
				}*/
                pagingBar:true
            },	
			  	// Grid.Plugins.Cascade 插件
          });
 
        grid.render();
		grid.on('cellclick',function  (ev) {
          var record = ev.record, //点击行的记录
            field = ev.field, //点击对应列的dataIndex
            target = $(ev.domTarget); //点击的元素
			<!--分页-->
			 
        });
      });